k6/Logs/0_k6-test.txt
2025-10-28T21:51:46.6187407Z Current runner version: '2.328.0'
2025-10-28T21:51:46.6214783Z ##[group]Runner Image Provisioner
2025-10-28T21:51:46.6215615Z Hosted Compute Agent
2025-10-28T21:51:46.6216152Z Version: 20250912.392
2025-10-28T21:51:46.6216791Z Commit: d921fda672a98b64f4f82364647e2f10b2267d0b
2025-10-28T21:51:46.6217460Z Build Date: 2025-09-12T15:23:14Z
2025-10-28T21:51:46.6218045Z ##[endgroup]
2025-10-28T21:51:46.6218542Z ##[group]Operating System
2025-10-28T21:51:46.6219162Z Ubuntu
2025-10-28T21:51:46.6219593Z 24.04.3
2025-10-28T21:51:46.6220021Z LTS
2025-10-28T21:51:46.6220700Z ##[endgroup]
2025-10-28T21:51:46.6221198Z ##[group]Runner Image
2025-10-28T21:51:46.6221758Z Image: ubuntu-24.04
2025-10-28T21:51:46.6222289Z Version: 20250929.60.1
2025-10-28T21:51:46.6223294Z Included Software: https://github.com/actions/runner-images/blob/ubuntu24/20250929.60/images/ubuntu/Ubuntu2404-Readme.md
2025-10-28T21:51:46.6224871Z Image Release: https://github.com/actions/runner-images/releases/tag/ubuntu24%2F20250929.60
2025-10-28T21:51:46.6225827Z ##[endgroup]
2025-10-28T21:51:46.6226950Z ##[group]GITHUB_TOKEN Permissions
2025-10-28T21:51:46.6229122Z Contents: read
2025-10-28T21:51:46.6229666Z Metadata: read
2025-10-28T21:51:46.6230183Z Packages: read
2025-10-28T21:51:46.6231150Z ##[endgroup]
2025-10-28T21:51:46.6233669Z Secret source: Actions
2025-10-28T21:51:46.6234447Z Prepare workflow directory
2025-10-28T21:51:46.6628629Z Prepare all required actions
2025-10-28T21:51:46.6667402Z Getting action download info
2025-10-28T21:51:47.0492356Z Download action repository 'actions/checkout@v4' (SHA:08eba0b27e820071cde6df949e0beb9ba4906955)
2025-10-28T21:51:47.1528718Z Download action repository 'grafana/k6-action@v0.3.0' (SHA:2bd221c807b7cdbe4bb3abc6b3fa4d2da499fa9b)
2025-10-28T21:51:47.8218023Z Complete job name: k6-test
2025-10-28T21:51:47.8771405Z ##[group]Build container for action use: '/home/runner/work/_actions/grafana/k6-action/v0.3.0/Dockerfile'.
2025-10-28T21:51:47.8822886Z ##[command]/usr/bin/docker build -t 536036:41bee8baa9044e83b30250dc7dfdadbc -f "/home/runner/work/_actions/grafana/k6-action/v0.3.0/Dockerfile" "/home/runner/work/_actions/grafana/k6-action/v0.3.0"
2025-10-28T21:51:48.5111755Z #0 building with "default" instance using docker driver
2025-10-28T21:51:48.5112537Z 
2025-10-28T21:51:48.5112988Z #1 [internal] load build definition from Dockerfile
2025-10-28T21:51:48.5114053Z #1 transferring dockerfile: 133B done
2025-10-28T21:51:48.5114952Z #1 DONE 0.0s
2025-10-28T21:51:48.5115323Z 
2025-10-28T21:51:48.5115877Z #2 [internal] load metadata for docker.io/grafana/k6:latest
2025-10-28T21:51:48.7163463Z #2 ...
2025-10-28T21:51:48.7163959Z 
2025-10-28T21:51:48.7164580Z #3 [auth] grafana/k6:pull token for registry-1.docker.io
2025-10-28T21:51:48.7165795Z #3 DONE 0.0s
2025-10-28T21:51:48.8663315Z 
2025-10-28T21:51:49.3104725Z #2 [internal] load metadata for docker.io/grafana/k6:latest
2025-10-28T21:51:49.3106848Z #2 DONE 0.9s
2025-10-28T21:51:49.4347506Z 
2025-10-28T21:51:49.4348189Z #4 [internal] load .dockerignore
2025-10-28T21:51:49.4349419Z #4 transferring context: 2B done
2025-10-28T21:51:49.4350658Z #4 DONE 0.0s
2025-10-28T21:51:49.4351081Z 
2025-10-28T21:51:49.4351408Z #5 [internal] load build context
2025-10-28T21:51:49.4352413Z #5 transferring context: 338B done
2025-10-28T21:51:49.4353376Z #5 DONE 0.0s
2025-10-28T21:51:49.4353813Z 
2025-10-28T21:51:49.4355265Z #6 [1/2] FROM docker.io/grafana/k6:latest@sha256:290b029fa9f50fb9e5d007a0cb8d97984f71cd2a31e5a092349c284a3cfff2c2
2025-10-28T21:51:49.4359131Z #6 resolve docker.io/grafana/k6:latest@sha256:290b029fa9f50fb9e5d007a0cb8d97984f71cd2a31e5a092349c284a3cfff2c2 done
2025-10-28T21:51:49.4362790Z #6 sha256:290b029fa9f50fb9e5d007a0cb8d97984f71cd2a31e5a092349c284a3cfff2c2 1.61kB / 1.61kB done
2025-10-28T21:51:49.4365963Z #6 sha256:a90b459a3768c46ad1013da53af24189f735d7112273c6ac3212ca8ed0e18656 1.05kB / 1.05kB done
2025-10-28T21:51:49.4369154Z #6 sha256:eeb0db19cd8d263aa57346cdbc7ea18e6fcfb2ba9497746a7ae82ceefc8c9fa5 1.50kB / 1.50kB done
2025-10-28T21:51:49.4372421Z #6 sha256:9824c27679d3b27c5e1cb00a73adb6f4f8d556994111c12db3c5d61a0c843df8 0B / 3.80MB 0.1s
2025-10-28T21:51:49.4375895Z #6 sha256:e488bc2c549704d3cab0b914e9e0d53d5dcf9018e1a0e63d66d94c9187398f18 0B / 935B 0.1s
2025-10-28T21:51:49.4379261Z #6 sha256:14c020c6cf1fa025da1ce8b3ae22ce4839c32e241c1977ca3822c744f38f7d89 0B / 31.32MB 0.1s
2025-10-28T21:51:49.6345857Z #6 sha256:9824c27679d3b27c5e1cb00a73adb6f4f8d556994111c12db3c5d61a0c843df8 2.10MB / 3.80MB 0.3s
2025-10-28T21:51:49.6350005Z #6 sha256:e488bc2c549704d3cab0b914e9e0d53d5dcf9018e1a0e63d66d94c9187398f18 935B / 935B 0.3s done
2025-10-28T21:51:49.7478228Z #6 sha256:4f4fb700ef54461cfa02571ae0db9a0dc1e0cdb5577484a6d75e68dc38e8acc1 0B / 32B 0.3s
2025-10-28T21:51:49.7482975Z #6 sha256:9824c27679d3b27c5e1cb00a73adb6f4f8d556994111c12db3c5d61a0c843df8 3.80MB / 3.80MB 0.3s done
2025-10-28T21:51:49.7487721Z #6 sha256:14c020c6cf1fa025da1ce8b3ae22ce4839c32e241c1977ca3822c744f38f7d89 3.15MB / 31.32MB 0.4s
2025-10-28T21:51:49.7492058Z #6 sha256:4f4fb700ef54461cfa02571ae0db9a0dc1e0cdb5577484a6d75e68dc38e8acc1 32B / 32B 0.4s done
2025-10-28T21:51:49.7496678Z #6 extracting sha256:9824c27679d3b27c5e1cb00a73adb6f4f8d556994111c12db3c5d61a0c843df8 0.1s done
2025-10-28T21:51:49.9337162Z #6 sha256:14c020c6cf1fa025da1ce8b3ae22ce4839c32e241c1977ca3822c744f38f7d89 12.58MB / 31.32MB 0.6s
2025-10-28T21:51:49.9338058Z #6 extracting sha256:e488bc2c549704d3cab0b914e9e0d53d5dcf9018e1a0e63d66d94c9187398f18 done
2025-10-28T21:51:50.0346162Z #6 sha256:14c020c6cf1fa025da1ce8b3ae22ce4839c32e241c1977ca3822c744f38f7d89 15.73MB / 31.32MB 0.7s
2025-10-28T21:51:50.3346282Z #6 sha256:14c020c6cf1fa025da1ce8b3ae22ce4839c32e241c1977ca3822c744f38f7d89 19.92MB / 31.32MB 1.0s
2025-10-28T21:51:50.5339146Z #6 sha256:14c020c6cf1fa025da1ce8b3ae22ce4839c32e241c1977ca3822c744f38f7d89 27.26MB / 31.32MB 1.2s
2025-10-28T21:51:50.6860865Z #6 sha256:14c020c6cf1fa025da1ce8b3ae22ce4839c32e241c1977ca3822c744f38f7d89 31.32MB / 31.32MB 1.2s done
2025-10-28T21:51:50.6862118Z #6 extracting sha256:14c020c6cf1fa025da1ce8b3ae22ce4839c32e241c1977ca3822c744f38f7d89 0.1s
2025-10-28T21:51:50.9114624Z #6 extracting sha256:14c020c6cf1fa025da1ce8b3ae22ce4839c32e241c1977ca3822c744f38f7d89 0.3s done
2025-10-28T21:51:50.9115650Z #6 extracting sha256:4f4fb700ef54461cfa02571ae0db9a0dc1e0cdb5577484a6d75e68dc38e8acc1 done
2025-10-28T21:51:50.9116436Z #6 DONE 1.6s
2025-10-28T21:51:51.0134401Z 
2025-10-28T21:51:51.0135241Z #7 [2/2] COPY entrypoint.sh /entrypoint.sh
2025-10-28T21:51:51.0135836Z #7 DONE 0.0s
2025-10-28T21:51:51.0136061Z 
2025-10-28T21:51:51.0136214Z #8 exporting to image
2025-10-28T21:51:51.0136619Z #8 exporting layers 0.1s done
2025-10-28T21:51:51.0137478Z #8 writing image sha256:c53d8a35259edf6e785a9ef8b6eef1e6a5a84e19dac0937cf9420aa9ae058a1f done
2025-10-28T21:51:51.0138611Z #8 naming to docker.io/library/536036:41bee8baa9044e83b30250dc7dfdadbc done
2025-10-28T21:51:51.0139260Z #8 DONE 0.1s
2025-10-28T21:51:51.0368476Z ##[endgroup]
2025-10-28T21:51:51.0623211Z ##[group]Run actions/checkout@v4
2025-10-28T21:51:51.0623765Z with:
2025-10-28T21:51:51.0623996Z   repository: Emaus025/colibri-app
2025-10-28T21:51:51.0624443Z   token: ***
2025-10-28T21:51:51.0624618Z   ssh-strict: true
2025-10-28T21:51:51.0624799Z   ssh-user: git
2025-10-28T21:51:51.0624995Z   persist-credentials: true
2025-10-28T21:51:51.0625218Z   clean: true
2025-10-28T21:51:51.0625408Z   sparse-checkout-cone-mode: true
2025-10-28T21:51:51.0625646Z   fetch-depth: 1
2025-10-28T21:51:51.0625822Z   fetch-tags: false
2025-10-28T21:51:51.0626031Z   show-progress: true
2025-10-28T21:51:51.0626225Z   lfs: false
2025-10-28T21:51:51.0626382Z   submodules: false
2025-10-28T21:51:51.0626601Z   set-safe-directory: true
2025-10-28T21:51:51.0627001Z ##[endgroup]
2025-10-28T21:51:51.1727745Z Syncing repository: Emaus025/colibri-app
2025-10-28T21:51:51.1729803Z ##[group]Getting Git version info
2025-10-28T21:51:51.1730712Z Working directory is '/home/runner/work/colibri-app/colibri-app'
2025-10-28T21:51:51.1731771Z [command]/usr/bin/git version
2025-10-28T21:51:51.1741072Z git version 2.51.0
2025-10-28T21:51:51.1767818Z ##[endgroup]
2025-10-28T21:51:51.1783624Z Temporarily overriding HOME='/home/runner/work/_temp/040c29b2-e5f6-44be-8799-44c3ae47881a' before making global git config changes
2025-10-28T21:51:51.1784998Z Adding repository directory to the temporary git global config as a safe directory
2025-10-28T21:51:51.1797536Z [command]/usr/bin/git config --global --add safe.directory /home/runner/work/colibri-app/colibri-app
2025-10-28T21:51:51.1836181Z Deleting the contents of '/home/runner/work/colibri-app/colibri-app'
2025-10-28T21:51:51.1839857Z ##[group]Initializing the repository
2025-10-28T21:51:51.1844617Z [command]/usr/bin/git init /home/runner/work/colibri-app/colibri-app
2025-10-28T21:51:51.1981024Z hint: Using 'master' as the name for the initial branch. This default branch name
2025-10-28T21:51:51.1982006Z hint: is subject to change. To configure the initial branch name to use in all
2025-10-28T21:51:51.1982569Z hint: of your new repositories, which will suppress this warning, call:
2025-10-28T21:51:51.1982933Z hint:
2025-10-28T21:51:51.1983192Z hint: 	git config --global init.defaultBranch <name>
2025-10-28T21:51:51.1983485Z hint:
2025-10-28T21:51:51.1983765Z hint: Names commonly chosen instead of 'master' are 'main', 'trunk' and
2025-10-28T21:51:51.1984521Z hint: 'development'. The just-created branch can be renamed via this command:
2025-10-28T21:51:51.1985218Z hint:
2025-10-28T21:51:51.1985478Z hint: 	git branch -m <name>
2025-10-28T21:51:51.1985696Z hint:
2025-10-28T21:51:51.1986002Z hint: Disable this message with "git config set advice.defaultBranchName false"
2025-10-28T21:51:51.1986842Z Initialized empty Git repository in /home/runner/work/colibri-app/colibri-app/.git/
2025-10-28T21:51:51.1997658Z [command]/usr/bin/git remote add origin https://github.com/Emaus025/colibri-app
2025-10-28T21:51:51.2033923Z ##[endgroup]
2025-10-28T21:51:51.2034549Z ##[group]Disabling automatic garbage collection
2025-10-28T21:51:51.2038796Z [command]/usr/bin/git config --local gc.auto 0
2025-10-28T21:51:51.2066540Z ##[endgroup]
2025-10-28T21:51:51.2067144Z ##[group]Setting up auth
2025-10-28T21:51:51.2074542Z [command]/usr/bin/git config --local --name-only --get-regexp core\.sshCommand
2025-10-28T21:51:51.2105291Z [command]/usr/bin/git submodule foreach --recursive sh -c "git config --local --name-only --get-regexp 'core\.sshCommand' && git config --local --unset-all 'core.sshCommand' || :"
2025-10-28T21:51:51.2520141Z [command]/usr/bin/git config --local --name-only --get-regexp http\.https\:\/\/github\.com\/\.extraheader
2025-10-28T21:51:51.2551196Z [command]/usr/bin/git submodule foreach --recursive sh -c "git config --local --name-only --get-regexp 'http\.https\:\/\/github\.com\/\.extraheader' && git config --local --unset-all 'http.https://github.com/.extraheader' || :"
2025-10-28T21:51:51.2775894Z [command]/usr/bin/git config --local http.https://github.com/.extraheader AUTHORIZATION: basic ***
2025-10-28T21:51:51.2819898Z ##[endgroup]
2025-10-28T21:51:51.2821073Z ##[group]Fetching the repository
2025-10-28T21:51:51.2829579Z [command]/usr/bin/git -c protocol.version=2 fetch --no-tags --prune --no-recurse-submodules --depth=1 origin +8e1a06b9cb9e2f15319cbc544316c0424eeeb327:refs/remotes/origin/main
2025-10-28T21:51:51.9079808Z From https://github.com/Emaus025/colibri-app
2025-10-28T21:51:51.9080787Z  * [new ref]         8e1a06b9cb9e2f15319cbc544316c0424eeeb327 -> origin/main
2025-10-28T21:51:51.9112103Z ##[endgroup]
2025-10-28T21:51:51.9112695Z ##[group]Determining the checkout info
2025-10-28T21:51:51.9115205Z ##[endgroup]
2025-10-28T21:51:51.9120251Z [command]/usr/bin/git sparse-checkout disable
2025-10-28T21:51:51.9163045Z [command]/usr/bin/git config --local --unset-all extensions.worktreeConfig
2025-10-28T21:51:51.9191270Z ##[group]Checking out the ref
2025-10-28T21:51:51.9195462Z [command]/usr/bin/git checkout --progress --force -B main refs/remotes/origin/main
2025-10-28T21:51:51.9331397Z Switched to a new branch 'main'
2025-10-28T21:51:51.9332409Z branch 'main' set up to track 'origin/main'.
2025-10-28T21:51:51.9338773Z ##[endgroup]
2025-10-28T21:51:51.9378238Z [command]/usr/bin/git log -1 --format=%H
2025-10-28T21:51:51.9401476Z 8e1a06b9cb9e2f15319cbc544316c0424eeeb327
2025-10-28T21:51:51.9595220Z ##[group]Run grafana/k6-action@v0.3.0
2025-10-28T21:51:51.9595497Z with:
2025-10-28T21:51:51.9595670Z   filename: k6/script.js
2025-10-28T21:51:51.9595867Z   cloud: false
2025-10-28T21:51:51.9596037Z ##[endgroup]
2025-10-28T21:51:51.9711053Z ##[command]/usr/bin/docker run --name bee8baa9044e83b30250dc7dfdadbc_62a917 --label 536036 --workdir /github/workspace --rm -e "INPUT_FILENAME" -e "INPUT_CLOUD" -e "INPUT_TOKEN" -e "INPUT_FLAGS" -e "K6_CLOUD_TOKEN" -e "HOME" -e "GITHUB_JOB" -e "GITHUB_REF" -e "GITHUB_SHA" -e "GITHUB_REPOSITORY" -e "GITHUB_REPOSITORY_OWNER" -e "GITHUB_REPOSITORY_OWNER_ID" -e "GITHUB_RUN_ID" -e "GITHUB_RUN_NUMBER" -e "GITHUB_RETENTION_DAYS" -e "GITHUB_RUN_ATTEMPT" -e "GITHUB_ACTOR_ID" -e "GITHUB_ACTOR" -e "GITHUB_WORKFLOW" -e "GITHUB_HEAD_REF" -e "GITHUB_BASE_REF" -e "GITHUB_EVENT_NAME" -e "GITHUB_SERVER_URL" -e "GITHUB_API_URL" -e "GITHUB_GRAPHQL_URL" -e "GITHUB_REF_NAME" -e "GITHUB_REF_PROTECTED" -e "GITHUB_REF_TYPE" -e "GITHUB_WORKFLOW_REF" -e "GITHUB_WORKFLOW_SHA" -e "GITHUB_REPOSITORY_ID" -e "GITHUB_TRIGGERING_ACTOR" -e "GITHUB_WORKSPACE" -e "GITHUB_ACTION" -e "GITHUB_EVENT_PATH" -e "GITHUB_ACTION_REPOSITORY" -e "GITHUB_ACTION_REF" -e "GITHUB_PATH" -e "GITHUB_ENV" -e "GITHUB_STEP_SUMMARY" -e "GITHUB_STATE" -e "GITHUB_OUTPUT" -e "RUNNER_OS" -e "RUNNER_ARCH" -e "RUNNER_NAME" -e "RUNNER_ENVIRONMENT" -e "RUNNER_TOOL_CACHE" -e "RUNNER_TEMP" -e "RUNNER_WORKSPACE" -e "ACTIONS_RUNTIME_URL" -e "ACTIONS_RUNTIME_TOKEN" -e "ACTIONS_CACHE_URL" -e "ACTIONS_RESULTS_URL" -e GITHUB_ACTIONS=true -e CI=true -v "/var/run/docker.sock":"/var/run/docker.sock" -v "/home/runner/work/_temp/_github_home":"/github/home" -v "/home/runner/work/_temp/_github_workflow":"/github/workflow" -v "/home/runner/work/_temp/_runner_file_commands":"/github/file_commands" -v "/home/runner/work/colibri-app/colibri-app":"/github/workspace" 536036:41bee8baa9044e83b30250dc7dfdadbc  "false" "k6/script.js" ""
2025-10-28T21:51:52.2118005Z 
2025-10-28T21:51:52.2118989Z          /\      Grafana   /‾‾/  
2025-10-28T21:51:52.2121455Z     /\  /  \     |\  __   /  /   
2025-10-28T21:51:52.2121919Z    /  \/    \    | |/ /  /   ‾‾\ 
2025-10-28T21:51:52.2122348Z   /          \   |   (  |  (‾)  |
2025-10-28T21:51:52.2122707Z  / __________ \  |_|\_\  \_____/ 
2025-10-28T21:51:52.2122942Z 
2025-10-28T21:51:52.2142498Z      execution: local
2025-10-28T21:51:52.2143676Z         script: k6/script.js
2025-10-28T21:51:52.2157569Z         output: -
2025-10-28T21:51:52.2157887Z 
2025-10-28T21:51:52.2158304Z      scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
2025-10-28T21:51:52.2159549Z               * default: 10 looping VUs for 30s (gracefulStop: 30s)
2025-10-28T21:51:52.2160057Z 
2025-10-28T21:51:53.2150615Z 
2025-10-28T21:51:53.2151074Z running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
2025-10-28T21:51:53.2151509Z default   [   3% ] 10 VUs  01.0s/30s
2025-10-28T21:51:54.2151434Z 
2025-10-28T21:51:54.2152051Z running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
2025-10-28T21:51:54.2152638Z default   [   7% ] 10 VUs  02.0s/30s
2025-10-28T21:51:55.2146215Z 
2025-10-28T21:51:55.2146745Z running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
2025-10-28T21:51:55.2147180Z default   [  10% ] 10 VUs  03.0s/30s
2025-10-28T21:51:56.2148011Z 
2025-10-28T21:51:56.2148600Z running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
2025-10-28T21:51:56.2149108Z default   [  13% ] 10 VUs  04.0s/30s
2025-10-28T21:51:57.2148678Z 
2025-10-28T21:51:57.2151199Z running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
2025-10-28T21:51:57.2151604Z default   [  17% ] 10 VUs  05.0s/30s
2025-10-28T21:51:58.2150994Z 
2025-10-28T21:51:58.2151460Z running (0m06.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
2025-10-28T21:51:58.2151867Z default   [  20% ] 10 VUs  06.0s/30s
2025-10-28T21:51:59.2152778Z 
2025-10-28T21:51:59.2153398Z running (0m07.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
2025-10-28T21:51:59.2154257Z default   [  23% ] 10 VUs  07.0s/30s
2025-10-28T21:52:00.2143655Z 
2025-10-28T21:52:00.2144250Z running (0m08.0s), 10/10 VUs, 27 complete and 0 interrupted iterations
2025-10-28T21:52:00.2144771Z default   [  27% ] 10 VUs  08.0s/30s
2025-10-28T21:52:01.2146639Z 
2025-10-28T21:52:01.2147203Z running (0m09.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
2025-10-28T21:52:01.2147688Z default   [  30% ] 10 VUs  09.0s/30s
2025-10-28T21:52:02.2149474Z 
2025-10-28T21:52:02.2150093Z running (0m10.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
2025-10-28T21:52:02.2150887Z default   [  33% ] 10 VUs  10.0s/30s
2025-10-28T21:52:03.2144523Z 
2025-10-28T21:52:03.2145029Z running (0m11.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
2025-10-28T21:52:03.2145460Z default   [  37% ] 10 VUs  11.0s/30s
2025-10-28T21:52:04.2142447Z 
2025-10-28T21:52:04.2143025Z running (0m12.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
2025-10-28T21:52:04.2143523Z default   [  40% ] 10 VUs  12.0s/30s
2025-10-28T21:52:05.2142425Z 
2025-10-28T21:52:05.2142984Z running (0m13.0s), 10/10 VUs, 67 complete and 0 interrupted iterations
2025-10-28T21:52:05.2143545Z default   [  43% ] 10 VUs  13.0s/30s
2025-10-28T21:52:06.2148249Z 
2025-10-28T21:52:06.2148814Z running (0m14.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
2025-10-28T21:52:06.2149297Z default   [  47% ] 10 VUs  14.0s/30s
2025-10-28T21:52:07.2143490Z 
2025-10-28T21:52:07.2144280Z running (0m15.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
2025-10-28T21:52:07.2144991Z default   [  50% ] 10 VUs  15.0s/30s
2025-10-28T21:52:08.2144000Z 
2025-10-28T21:52:08.2144645Z running (0m16.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
2025-10-28T21:52:08.2145265Z default   [  53% ] 10 VUs  16.0s/30s
2025-10-28T21:52:09.2152457Z 
2025-10-28T21:52:09.2153063Z running (0m17.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
2025-10-28T21:52:09.2153532Z default   [  57% ] 10 VUs  17.0s/30s
2025-10-28T21:52:10.2142220Z 
2025-10-28T21:52:10.2143115Z running (0m18.0s), 10/10 VUs, 108 complete and 0 interrupted iterations
2025-10-28T21:52:10.2143675Z default   [  60% ] 10 VUs  18.0s/30s
2025-10-28T21:52:11.2144944Z 
2025-10-28T21:52:11.2145482Z running (0m19.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
2025-10-28T21:52:11.2145899Z default   [  63% ] 10 VUs  19.0s/30s
2025-10-28T21:52:12.2148946Z 
2025-10-28T21:52:12.2149576Z running (0m20.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
2025-10-28T21:52:12.2150149Z default   [  67% ] 10 VUs  20.0s/30s
2025-10-28T21:52:13.2146068Z 
2025-10-28T21:52:13.2146658Z running (0m21.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
2025-10-28T21:52:13.2147147Z default   [  70% ] 10 VUs  21.0s/30s
2025-10-28T21:52:14.2149576Z 
2025-10-28T21:52:14.2150143Z running (0m22.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
2025-10-28T21:52:14.2150875Z default   [  73% ] 10 VUs  22.0s/30s
2025-10-28T21:52:15.2148740Z 
2025-10-28T21:52:15.2149255Z running (0m23.0s), 10/10 VUs, 148 complete and 0 interrupted iterations
2025-10-28T21:52:15.2149686Z default   [  77% ] 10 VUs  23.0s/30s
2025-10-28T21:52:16.2145674Z 
2025-10-28T21:52:16.2146231Z running (0m24.0s), 10/10 VUs, 151 complete and 0 interrupted iterations
2025-10-28T21:52:16.2146616Z default   [  80% ] 10 VUs  24.0s/30s
2025-10-28T21:52:17.2151112Z 
2025-10-28T21:52:17.2151587Z running (0m25.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
2025-10-28T21:52:17.2151987Z default   [  83% ] 10 VUs  25.0s/30s
2025-10-28T21:52:18.2147124Z 
2025-10-28T21:52:18.2147660Z running (0m26.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
2025-10-28T21:52:18.2148094Z default   [  87% ] 10 VUs  26.0s/30s
2025-10-28T21:52:19.2147310Z 
2025-10-28T21:52:19.2147835Z running (0m27.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
2025-10-28T21:52:19.2148265Z default   [  90% ] 10 VUs  27.0s/30s
2025-10-28T21:52:20.2147574Z 
2025-10-28T21:52:20.2148137Z running (0m28.0s), 10/10 VUs, 182 complete and 0 interrupted iterations
2025-10-28T21:52:20.2148934Z default   [  93% ] 10 VUs  28.0s/30s
2025-10-28T21:52:21.2145902Z 
2025-10-28T21:52:21.2146453Z running (0m29.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
2025-10-28T21:52:21.2146980Z default   [  97% ] 10 VUs  29.0s/30s
2025-10-28T21:52:22.2151399Z 
2025-10-28T21:52:22.2151925Z running (0m30.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
2025-10-28T21:52:22.2152366Z default   [ 100% ] 10 VUs  30.0s/30s
2025-10-28T21:52:23.1754939Z 
2025-10-28T21:52:23.1754952Z 
2025-10-28T21:52:23.1755643Z   █ TOTAL RESULTS 
2025-10-28T21:52:23.1755834Z 
2025-10-28T21:52:23.1755935Z     checks_total.......: 630     20.354401/s
2025-10-28T21:52:23.1756217Z     checks_succeeded...: 100.00% 630 out of 630
2025-10-28T21:52:23.1756469Z     checks_failed......: 0.00%   0 out of 630
2025-10-28T21:52:23.1756664Z 
2025-10-28T21:52:23.1756909Z     ✓ Login status 200
2025-10-28T21:52:23.1757297Z     ✓ Login tiene token
2025-10-28T21:52:23.1757686Z     ✓ Booking status 201
2025-10-28T21:52:23.1757922Z 
2025-10-28T21:52:23.1758010Z     CUSTOM
2025-10-28T21:52:23.1758351Z     booking_success................: 210    6.7848/s
2025-10-28T21:52:23.1758820Z     login_success..................: 210    6.7848/s
2025-10-28T21:52:23.1759130Z 
2025-10-28T21:52:23.1759233Z     HTTP
2025-10-28T21:52:23.1759683Z     http_req_duration..............: avg=226.79ms min=84.11ms med=118.16ms max=4.25s p(90)=171.27ms p(95)=306.12ms
2025-10-28T21:52:23.1760229Z       { expected_response:true }...: avg=226.79ms min=84.11ms med=118.16ms max=4.25s p(90)=171.27ms p(95)=306.12ms
2025-10-28T21:52:23.1760883Z     http_req_failed................: 0.00%  0 out of 420
2025-10-28T21:52:23.1761163Z     http_reqs......................: 420    13.569601/s
2025-10-28T21:52:23.1761345Z 
2025-10-28T21:52:23.1761407Z     EXECUTION
2025-10-28T21:52:23.1761727Z     iteration_duration.............: avg=1.45s    min=1.18s   med=1.24s    max=5.49s p(90)=1.4s     p(95)=1.65s   
2025-10-28T21:52:23.1762134Z     iterations.....................: 210    6.7848/s
2025-10-28T21:52:23.1762415Z     vus............................: 10     min=10       max=10
2025-10-28T21:52:23.1762704Z     vus_max........................: 10     min=10       max=10
2025-10-28T21:52:23.1762901Z 
2025-10-28T21:52:23.1762963Z     NETWORK
2025-10-28T21:52:23.1763145Z     data_received..................: 172 kB 5.5 kB/s
2025-10-28T21:52:23.1763412Z     data_sent......................: 57 kB  1.8 kB/s
2025-10-28T21:52:23.1763581Z 
2025-10-28T21:52:23.1763603Z 
2025-10-28T21:52:23.1763606Z 
2025-10-28T21:52:23.1763610Z 
2025-10-28T21:52:23.1763771Z running (0m31.0s), 00/10 VUs, 210 complete and 0 interrupted iterations
2025-10-28T21:52:23.1764167Z default ✓ [ 100% ] 10 VUs  30s
2025-10-28T21:52:23.3390676Z Post job cleanup.
2025-10-28T21:52:23.4303161Z [command]/usr/bin/git version
2025-10-28T21:52:23.4338882Z git version 2.51.0
2025-10-28T21:52:23.4382823Z Temporarily overriding HOME='/home/runner/work/_temp/e65c9a93-e4c6-4d3a-aeb9-609f77191428' before making global git config changes
2025-10-28T21:52:23.4384106Z Adding repository directory to the temporary git global config as a safe directory
2025-10-28T21:52:23.4389125Z [command]/usr/bin/git config --global --add safe.directory /home/runner/work/colibri-app/colibri-app
2025-10-28T21:52:23.4423763Z [command]/usr/bin/git config --local --name-only --get-regexp core\.sshCommand
2025-10-28T21:52:23.4525146Z [command]/usr/bin/git submodule foreach --recursive sh -c "git config --local --name-only --get-regexp 'core\.sshCommand' && git config --local --unset-all 'core.sshCommand' || :"
2025-10-28T21:52:23.4693302Z [command]/usr/bin/git config --local --name-only --get-regexp http\.https\:\/\/github\.com\/\.extraheader
2025-10-28T21:52:23.4714543Z http.https://github.com/.extraheader
2025-10-28T21:52:23.4726471Z [command]/usr/bin/git config --local --unset-all http.https://github.com/.extraheader
2025-10-28T21:52:23.4755735Z [command]/usr/bin/git submodule foreach --recursive sh -c "git config --local --name-only --get-regexp 'http\.https\:\/\/github\.com\/\.extraheader' && git config --local --unset-all 'http.https://github.com/.extraheader' || :"
2025-10-28T21:52:23.5079943Z Cleaning up orphan processes